import pulp as pl

# Входные данные.
A = ([150, 200, 100])
B = ([90, 150, 75, 60, 75])
D = ([[15, 23, 28, 19, 17],
      [17, 13, 14, 12, 20],
      [13, 21, 24, 16, 12]])

# Набор переменных.
X = [pl.LpVariable(name=("x" + str(i + 1)), lowBound=0, cat='Integer') for i in range(15)]

task = pl.LpProblem('Transport', pl.LpMaximize)

# Задание целевой функции.
task += (D[0][0] * X[0] + D[0][1] * X[1] + D[0][2] * X[2] + D[0][3] * X[3] + D[0][4] * X[4] + D[1][0] * X[5] + D[1][1] * X[6] + D[1][2] * X[7] + D[1][3] * X[8] + D[1][4] * X[9] + D[2][0] * X[10] + D[2][1] * X[11] + D[2][2] * X[12] + D[2][3] * X[13] + D[2][4] * X[14])

task += (X[0] + X[1] + X[2] + X[3] + X[4] == A[0])
task += (X[5] + X[6] + X[7] + X[8] + X[9] == A[1])
task += (X[10] + X[11] + X[12] + X[13] + X[14] == A[2])

task += (X[0] + X[5] + X[10] == B[0])
task += (X[1] + X[6] + X[11] == B[1])
task += (X[2] + X[7] + X[12] == B[2])
task += (X[3] + X[8] + X[13] == B[3])
task += (X[4] + X[9] + X[14] == B[4])

# Решаем транспортную задачу.
task.solve()

# Вывод результатов.
print (f'Максимальная прибыль: {pl.value(task.objective)}')
